examples_free_decay/3D_RM6_pitch/mesh_3x/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "cellDisplacement.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0;
        maxIter         100;
    }

    "alpha.water.*"
    {
        nAlphaCorr      3;
        nAlphaSubCycles 2;
        cAlpha          1;
        icAlpha         0;

        MULESCorr       yes;
        nLimiterIter    5;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0;
    }

    "pcorr.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0;
    }

    p_rgh
    {
        // dynamic overset
        solver          PBiCGStab;
        preconditioner  DILU;
//        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0.01;

//        // non-overset
//        solver          PCG;
//        preconditioner  DIC;
//        tolerance       1e-6;
//        relTol          0;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-9;
        relTol          0.0;
    }

    "(U|k|epsilon|omega|B|nuTilda).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-08;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor no;
    nOuterCorrectors    3;
    nCorrectors         3;
    nNonOrthogonalCorrectors 1;
    moveMeshOuterCorrectors true;
    oversetAdjustPhi    true;
}

relaxationFactors
{
    equations
    {
        ".*"      1.0;
    }
}

cache
{
  grad(U);
}

// ************************************************************************* //
